# Datenbanken mit SQLite

[SQLite-Docu](https://www.sqlite.org/lang.html) <br>
Web-Client: [Sqlite Browser](https://sqliteonline.com/)    <br>
Lokaler-Client: [DB Browser for SQLite](https://sqlitebrowser.org/)

#### Tabelle anlegen

In [2]:
import sqlite3 as sq

In [ ]:
# Eine Verbindung zur Datenbank aufbauen. 
# Die Datei wird neu angelegt, falls sie noch nicht existiert
connection = sq.connect("verwaltung.db")       
connection.close()

In [ ]:
# Eine Datenbank anlegen, ohne sie abzuspeichern
connection = sq.connect(":memory:")       
connection.close()

Um mit einer verbunden Datenbank zu arbeiten, wird ein Cursor benötigt. Den kann man sich als einen Zeiger auf die aktuelle Bearbeitungsposition vorstellen. Es kann mehrere Cursor geben.

SQL-Anweisungen sind nicht case-sensitiv. Es ist aber üblich, SQL Schlüsselworte mit Großbuchstaben zu schreiben.

Beim Anlegen einer Tabelle muss der Datentyp der festgelegt werden.

Python - Sqlite3
* None - NULL
* int - INTEGER
* float - REAL
* str - TEXT
* bytes - BLOB

In [5]:
# Tabelle in einer Datenbank anlegen
connection = sq.connect("univerwaltung.db")  
cursor = connection.cursor()
cursor.execute("CREATE TABLE student (name TEXT, ort TEXT, fach TEXT, semester INTEGER)")
connection.close()

In [ ]:
# Beim create können weitere Eigenschaften der Felder definiert werden.
CREATE TABLE mitglied (mnr INTEGER PRIMARY KEY AUTOINCREMENT, Name TEXT NOT NULL, beitrag REAL NOT NULL DEFAULT '0.00')

#### Daten in eine Tabelle einfügen

In [7]:
# Daten in eine Tabelle einfügen
connection = sq.connect("univerwaltung.db")  
cursor = connection.cursor()
cursor.execute("INSERT INTO student VALUES ('Malte', 'Münster', 'Philosophie', 12)")
connection.commit()    # erst durch commit werden die Daten gespeichert
connection.close()

#### Transaktionen, Commit, Rollback

**Transaktionen** sind Ketten von Operationen, die vollständig ausgeführt werden müssen, damit
die Konsistenz der Datenbank erhalten bleibt. Um die Datenbank transaktionssicher zu machen, werden kritische Anweisungen
mit einer try-except-Anweisung umgeben. Der **rollback** macht alles bis zum letzten **commit** rückgängig.

In [ ]:
# Transaktionssicherheit
connection = sq.connect("univerwaltung.db")
try:
    cursor = connection.cursor()
    cursor.execute("INSERT INTO student VALUES ('Malte', 'Münster', 'Philosophie', 12)")
    # Hier können weitere Datenbankmanipulationen stehen
    connection.commit()
except:
    print("Ein Problem trat auf -> Rollback")
    connection.rollback()
connection.close()

#### Daten einfügen mit Fragezeichen-Parameter

Häufig ist es einfacher, die einzufügenden Daten unabhängig vom SQL-Statement zu generieren.

In [8]:
connection = sq.connect("univerwaltung.db")  
cursor = connection.cursor()

daten = ("Malte", "Münster", "Philosophie", 12)
sql = "INSERT INTO student VALUES (?,?,?,?)"    
cursor.execute(sql,daten)

connection.commit()     
connection.close()

Wir erstellen die Tabelle student neu:

In [14]:
data = \
(("Malte", "Münster", "Philosophie", 12),
("Malte", "Münster", "Mathematik", 12),
("John", "Bochum", "BWL", 5),
("John", "Bochum", "Informatik", 5))
    
connection = sq.connect("univerwaltung.db")  
cursor = connection.cursor()
cursor.execute("DROP TABLE IF EXISTS student")
cursor.execute("""
CREATE TABLE student (name TEXT, ort TEXT, fach TEXT, semester INTEGER)
""")

for d in data:
    sql = "INSERT INTO student VALUES (?,?,?,?)"
    cursor.execute(sql,d)

connection.commit()
connection.close()

#### Daten einfügen mit executemany

Die Methode **executemany** ist schneller als das INSERT in der Schleife. **Dies ist unsere bevorzugte Art, eine Tabelle mit Daten zu füllen:**

In [16]:
data = \
(("Malte", "Münster", "Philosophie", 12),
("Malte", "Münster", "Mathematik", 12),
("John", "Bochum", "BWL", 5),
("John", "Bochum", "Informatik", 5))
    
connection = sq.connect("univerwaltung.db")  
cursor = connection.cursor()
cursor.execute("DROP TABLE IF EXISTS student")
cursor.execute("""
CREATE TABLE student (name TEXT, ort TEXT, fach TEXT, semester INTEGER)
""")

cursor.executemany("INSERT INTO student VALUES (?,?,?,?)",data)

connection.commit()
connection.close()

#### Daten auslesen mit fetchall

In [17]:
connection = sq.connect("univerwaltung.db")  
cursor = connection.cursor()

sql = "SELECT * FROM student"

cursor.execute(sql)
data = cursor.fetchall()
connection.close()
print(data)

[('Malte', 'Münster', 'Philosophie', 12), ('Malte', 'Münster', 'Mathematik', 12), ('John', 'Bochum', 'BWL', 5), ('John', 'Bochum', 'Informatik', 5)]

#### Daten auslesen mit cursor-Schleife

Liefert eine Abfrage sehr große Datenmengen, dann kann das Resultat von fetchall zu Speicherproblemen führen. 
Wir können die Datensätze des Resultats auch mit einer for-Schleife über den cursor erhalten. **Mit einer Format-Angabe und dem 
'*'-Operator ist dies unsere bevorzugte Art, Daten aus einer Tabelle zu lesen.**

In [28]:
connection = sq.connect("univerwaltung.db")  
cursor = connection.cursor()

sql = "SELECT * FROM student"

cursor.execute(sql)
form = "{:10s} {:10s} {:12s} {:4d}"
for zeile in cursor:
    print(form.format(*zeile))
connection.close()

Malte      Münster    Philosophie    12
Malte      Münster    Mathematik     12
John       Bochum     BWL             5
John       Bochum     Informatik      5

#### Informationen zur Datenbank abfragen

In [38]:
# Die Namen der Tabellen einer Datenbank listen
connection = sq.connect('univerwaltung.db')
cursor = connection.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
for r in cursor:
    print(r)
connection.close()

('student',)

In [37]:
# Die Namen der Felder einer Tabelle listen
connection = sq.connect('univerwaltung.db')
cursor = connection.cursor()
cursor.execute("SELECT * FROM student")
felder = [x[0] for x in cursor.description]
connection.close()
felder

['name', 'ort', 'fach', 'semester']

In [34]:
# die CREATE-Anweisungen für die einzelnen Tabellen listen
connection = sq.connect('univerwaltung.db')
cursor = connection.cursor()
cursor.execute("select sql from sqlite_master where type='table'")
for r in cursor:
    print(r[0])
connection.close()

CREATE TABLE student (name TEXT, ort TEXT, fach TEXT, semester INTEGER)

#### SQL-Abfragen

In [129]:
import sportverein
sportverein.createDB()

In [130]:
# die CREATE-Anweisungen für die einzelnen Tabellen listen
connection = sq.connect('sportverein.db')
cursor = connection.cursor()
cursor.execute("select sql from sqlite_master where type='table'")
for r in cursor:
    print(r[0])
connection.close()

CREATE TABLE sqlite_sequence(name,seq)
CREATE TABLE "temp"(mnr INT,zaehl)
CREATE TABLE mitglied (MNr INTEGER PRIMARY KEY AUTOINCREMENT,
    Name TEXT NOT NULL, Vorname TEXT NOT NULL, Telefon TEXT DEFAULT NULL,
    Konto TEXT NOT NULL, BLZ INTEGER NOT NULL DEFAULT '0',
    Beitrag REAL NOT NULL DEFAULT '0.00')
CREATE TABLE bank (blz INTEGER PRIMARY KEY, bezeichnung VARCHAR(20))
CREATE TABLE uebungsgruppe (Unr INTEGER PRIMARY KEY AUTOINCREMENT,
    Sportart TEXT NOT NULL DEFAULT '', MNr INTEGER NOT NULL DEFAULt '0')
CREATE TABLE trainingsort (Ort TEXT PRIMARY KEY,
    HNr INTEGER NOT NULL DEFAULT '0')
CREATE TABLE trainingszeit (Tag TEXT NOT NULL DEFAULT '',
    ZEIT TEXT NOT NULL DEFAULT '00:00:00',
    UNr INTEGER NOT NULL DEFAULT '0',
    ORT TEXT NOT NULL)
CREATE TABLE hausmeister (HNr INTEGER PRIMARY KEY, Name TEXT, Telefon Text)
CREATE TABLE teilnehmer (MNr INTEGER NOT NULL DEFAULT '0',
    UNr INTEGER NOT NULL DEFAULT '0')

In [7]:
def abfrage(sql):
    '''
    sql: String mit SQL-Anweisung
    returns: None, printed die Ergebniszeilen
    '''
    connection = sq.connect("sportverein.db")  
    cursor = connection.cursor()

    cursor.execute(sql)
    connection.commit()
    for zeile in cursor:
        print(*zeile)
    connection.close()

In [9]:
sql = "SELECT * FROM uebungsgruppe"
abfrage(sql)

1 Schwimmen 1990
2 Fußball 2010
3 Tennis 2229
4 Volleyball 2832
5 Wasserball 1990
6 Tauchen 2595
7 Basketball 2577
8 Turnen 2643
9 Langlauf 2349
10 Fußball 1977
11 Volleyball 1993
12 Schwimmen 2173
13 Fußball 2010
14 Volleyball 1993
15 Fußball 2189
16 Schwimmen 2638
17 Fußball 2632

In [8]:
sql = "SELECT sportart FROM uebungsgruppe"
abfrage(sql)

Schwimmen
Fußball
Tennis
Volleyball
Wasserball
Tauchen
Basketball
Turnen
Langlauf
Fußball
Volleyball
Schwimmen
Fußball
Volleyball
Fußball
Schwimmen
Fußball

In [10]:
sql = "SELECT DISTINCT sportart FROM uebungsgruppe"
abfrage(sql)

Schwimmen
Fußball
Tennis
Volleyball
Wasserball
Tauchen
Basketball
Turnen
Langlauf

In [11]:
sql = "SELECT COUNT(DISTINCT sportart) FROM uebungsgruppe"
abfrage(sql)

9

Mit der **WHERE**-Klausel können wir Bedingungen formulieren.

In [16]:
sql = "SELECT * FROM uebungsgruppe  WHERE sportart = 'Fußball'"
abfrage(sql)

2 Fußball 2010
10 Fußball 1977
13 Fußball 2010
15 Fußball 2189
17 Fußball 2632

In [21]:
sql = "SELECT mnr, name FROM mitglied  WHERE Mnr < 1970"
abfrage(sql)

1963 Giek
1964 Kiefer
1965 Voss
1966 Matthies
1967 Krey
1968 Rehbock
1969 Siebert

In [23]:
sql = "SELECT mnr, name FROM mitglied WHERE mnr BETWEEN 1964 AND 1967"
abfrage(sql)

1964 Kiefer
1965 Voss
1966 Matthies
1967 Krey

In [29]:
sql = "SELECT mnr, name FROM mitglied WHERE name LIKE 'Ki%'"
abfrage(sql)

1964 Kiefer
1975 Kinner
2001 Kirchner
2568 Kilian
2638 Kistner
2897 Kistner

In [39]:
sql = "SELECT mnr, name FROM mitglied WHERE name LIKE '__a__'"
abfrage(sql)

2232 Braun
2339 Kraus
2481 Kraft
2736 Staps
2872 Kraft

In [42]:
sql = "SELECT mnr, name FROM mitglied WHERE name LIKE 'A%' AND (mnr < 2000 OR mnr > 2800)"
abfrage(sql)

1970 Auffarth
2823 Aebersold
2859 Adolphy
2873 Alt
2921 Autenrieth
2940 Andres

In [43]:
sql = "SELECT * FROM uebungsgruppe ORDER BY sportart"
abfrage(sql)

7 Basketball 2577
2 Fußball 2010
10 Fußball 1977
13 Fußball 2010
15 Fußball 2189
17 Fußball 2632
9 Langlauf 2349
1 Schwimmen 1990
12 Schwimmen 2173
16 Schwimmen 2638
6 Tauchen 2595
3 Tennis 2229
8 Turnen 2643
4 Volleyball 2832
11 Volleyball 1993
14 Volleyball 1993
5 Wasserball 1990

In [52]:
sql = "SELECT * FROM uebungsgruppe WHERE mnr> 2500 ORDER BY sportart DESC"
abfrage(sql)

4 Volleyball 2832
8 Turnen 2643
6 Tauchen 2595
16 Schwimmen 2638
17 Fußball 2632
7 Basketball 2577

In [55]:
sql = "SELECT * FROM mitglied WHERE mnr > 2500 LIMIT 10"
abfrage(sql)

2502 Tramski Werner 0041-31-8293110 31277895 18750023 52.0
2503 Bäz Peter 09324-693 87592808 75000092 34.0
2504 Hämmerle Jo  72328166 37500046 17.0
2505 Messner Klaus P. 0421-36116776 19491420 18750023 52.0
2506 Kunze Michael 06132-99510 92310756 37500046 34.0
2507 Friebe Herr 0611-317210 66889770 18750023 52.0
2508 Wolff Werner  16379051 37500046 17.0
2509 Lohr Claudia 07274-1060 82726781 37500046 17.0
2510 Welte Eckhard 02351-95930 89010877 56250069 34.0
2511 Frankerl Wolfgang 07131-562452 5817857 56250069 52.0

In [60]:
sql = "SELECT MIN(mnr), MAX(mnr), MAX(mnr)-MIN(mnr), COUNT(mnr) FROM mitglied"
abfrage(sql)

1963 2943 980 930

In [61]:
sql = "SELECT AVG(beitrag), SUM(beitrag) FROM mitglied"
abfrage(sql)

34.11827956989247 31730.0

In [63]:
sql = "SELECT * FROM uebungsgruppe WHERE sportart IN ('Fußball','Schwimmen')"
abfrage(sql)

1 Schwimmen 1990
2 Fußball 2010
10 Fußball 1977
12 Schwimmen 2173
13 Fußball 2010
15 Fußball 2189
16 Schwimmen 2638
17 Fußball 2632

In [64]:
sql = "SELECT name FROM mitglied WHERE mnr IN (SELECT mnr FROM uebungsgruppe)"
abfrage(sql)

Schinkmann
Rienhöfer
Ellerbusch
Böttcher
Weinert
Roth
Rudolph
Zwick
Müller
Liesch
Freyer
Kistner
Arndt
Wolf

In [72]:
# Aliasse für Spalten
sql = "SELECT name n, mnr m FROM mitglied WHERE n LIKE 'A%' and m > 2500"
abfrage(sql)

Anlauf 2579
Arndt 2643
Aluttis 2700
Aluttis 2734
Aebersold 2823
Adolphy 2859
Alt 2873
Autenrieth 2921
Andres 2940

In [133]:
# Jeder mit jedem
sql = "SELECT a.name, b.ort FROM hausmeister a, trainingsort b"
abfrage(sql)

Krause Bad1
Krause Bad2
Krause Bad3
Krause Halle1
Krause Halle2
Krause Halle3
Krause Platz1
Krause Platz2
Koschulte Bad1
Koschulte Bad2
Koschulte Bad3
Koschulte Halle1
Koschulte Halle2
Koschulte Halle3
Koschulte Platz1
Koschulte Platz2
Kacmarek Bad1
Kacmarek Bad2
Kacmarek Bad3
Kacmarek Halle1
Kacmarek Halle2
Kacmarek Halle3
Kacmarek Platz1
Kacmarek Platz2

In [132]:
# die Verbindung über die WHERE-Klausel
sql = "SELECT a.name, b.ort FROM hausmeister a, trainingsort b WHERE a.hnr = b.hnr"
abfrage(sql)

Krause Bad1
Koschulte Bad2
Koschulte Bad3
Koschulte Halle1
Koschulte Halle2
Kacmarek Halle3
Kacmarek Platz1
Krause Platz2

In [131]:
# besser: die Verbindung über JOIN
sql = """
SELECT a.name, b.ort FROM hausmeister a 
JOIN trainingsort b ON b.hnr = a.hnr
"""
abfrage(sql)

Krause Bad1
Koschulte Bad2
Koschulte Bad3
Koschulte Halle1
Koschulte Halle2
Kacmarek Halle3
Kacmarek Platz1
Krause Platz2

In [123]:
# liste die Namen aller Übungsleiter in Halle1
sql = """
SELECT a.name FROM mitglied a 
JOIN uebungsgruppe b ON b.mnr = a.mnr
JOIN trainingszeit c ON c.unr = b.unr
JOIN trainingsort d ON d.ort = c.ort
WHERE d.ort = "Halle1"
"""
abfrage(sql)

Müller
Ellerbusch

In [124]:
# GROUP BY wird oft mit den Aggregatfunktionen (COUNT, MAX, MIN, SUM, AVG) benutzt
sql = "SELECT blz, COUNT(blz) FROM mitglied GROUP BY blz"
abfrage(sql)

18750023 186
37500046 166
56250069 196
75000092 201
93750115 181

In [125]:
sql = """
SELECT COUNT(a.blz) zaehl, b.bezeichnung FROM mitglied a
JOIN bank b ON b.blz = a.blz
GROUP BY a.blz ORDER BY zaehl DESC
"""
abfrage(sql)

201 Sparkasse Rhynern
196 Volksbank Unna
186 Volksbank Mawicke
181 Deutsche Bank Soest
166 Sparkasse Echthausen

In [134]:
# HAVING ersetzt das WHERE bei Aggregatfunktionen.
# Liste alle sportarten, die mehr als einen Übungsleiter haben
sql = "SELECT COUNT(mnr), sportart FROM uebungsgruppe GROUP BY sportart HAVING count(mnr) > 1"
abfrage(sql)

5 Fußball
3 Schwimmen
3 Volleyball